common/forms/FetchLocationForm.php

SELECT * FROM `location` ORDER BY `id` DESC
---
    protected function createCommand()
    {
        $command = Location::find();