common/forms/SignupForm.php

    public function signup()
    {
        if (!$this->validate()) {
            return null;
        }

        $user = new User();
        $user->username = $this->username;
        $user->email = $this->email;
        $user->name = $this->username;
        $user->setPassword($this->password);
        $user->generateAuthKey();
        $this->setExtraAttributes($user);

        return $user->save() ? $user : null;
---
INSERT INTO `user` (`username`, `email`, `password_hash`, `auth_key`, `is_staff`, `status`, `created_at`, `updated_at`) VALUES ('admin', 'admin@gmail.com', '$2y$13$8VPK8vLNBzGE1YnkoCwHduQHQp/ZkrE7YOGpVpdR5fUkYXXsjlsGu', 'V_gop7szQaTclrDlTqC7tfLxWrToI9wn', 0, 10, 1502209348, 1502209348)