backend/forms/EditCategoryForm.php

    public function validateSlug($attribute, $params)
    {
        if (!$this->hasErrors()) {
            $slug = $this->$attribute;
            if (!preg_match('/^[a-z][-a-z0-9]*$/', $slug)) {
                $this->addError($attribute, "$slug does not match slug format!");
            }

            if (Category::find()->where(['slug' => $slug])->count() > 1) {
---
SELECT COUNT(*) FROM `category` WHERE `slug`='bat-dong-san'

    protected function getCategory()
    {
        if ($this->_category === null) {
            $this->_category = Category::findOne($this->id);
---
SELECT * FROM `category` WHERE `id`='7'